Classes | Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::Accessory Class Referencefinal
MEP Element Manager
The Accessory is a complex element with two ports on a single axis. More...
#include <MEPAccessory.hpp>
 Inheritance diagram for ACAPI::MEP::Accessory:
 Classes
class  | Modifier
Modifier of the Accessory. More...
 Public Member Functions
AccessoryDefault  | PickUpDefault () const
Picks up the Default from the Accessory.
Domain  | GetDomain () const
Returns the domain of the Accessory.
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::MEP::ModifiableElementBase
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::MEP::ElementBase
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Public Member Functions inherited from ACAPI::ElementBase
UniqueID  | GetElemId () const
Get unique identifier of the ElementBase object.
Result< void >  | IsEditable () const
Checks whether the element is editable.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< Accessory >  | Get (const UniqueID &uniqueId)
Returns an Accessory.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::ModifiableElementBase
ModifiableElementBase (std::shared_ptr< Impl::IElementBaseImpl > impl)
Constructs a ModifiableElementBase with the IElementBaseImpl.
 Protected Member Functions inherited from ACAPI::MEP::ElementBase
ElementBase (std::shared_ptr< Impl::IElementBaseImpl > impl)
Constructs an ElementBase with an element base implementation.
 Protected Member Functions inherited from ACAPI::ElementBase
ElementBase (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new ElementBase.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The Accessory is a complex element with two ports on a single axis.
Since
Archicad 27
Member Function Documentation
◆ Get()
 static Result< Accessory > ACAPI::MEP::Accessory::Get  |  ( |  const UniqueID & |  uniqueId | )
static
Returns an Accessory.
Parameters
uniqueId | The UniqueID of the requested Accessory.
Returns
If the uniqueId belongs to an Accessory, returns the object associated to it, otherwise Error.
◆ GetDomain()
 Domain ACAPI::MEP::Accessory::GetDomain  |  ( |   | ) |   const
Returns the domain of the Accessory.
Returns
The returned domain can be ventilation or piping.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::Accessory::Modify  |  ( |  const ModifierFunc & |  modifierFunc,
|  const GS::UniString & |  undoString )
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ PickUpDefault()
 AccessoryDefault ACAPI::MEP::Accessory::PickUpDefault  |  ( |   | ) |   const
Picks up the Default from the Accessory.
Returns
Returns an AccessoryDefault with the parameters of the object it was called for.